Revit 2023 API
MassZone.GetMassDataElementIdForZoneFaceReference Method
 MassZone faces come from faces of MassEnergyAnalyticalModel, and those faces have MassSurfaceData or MassLevelData elements associated with them.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2012
Syntax
C#
public ElementId GetMassDataElementIdForZoneFaceReference(
	Reference referenceOfZone
)
Visual Basic
Public Function GetMassDataElementIdForZoneFaceReference ( _
	referenceOfZone As Reference _
) As ElementId
Visual C++
public:
ElementId^ GetMassDataElementIdForZoneFaceReference(
	Reference^ referenceOfZone
)
Parameters
referenceOfZone
Type: Autodesk.Revit.DB.Reference
 Reference to face of the MassZone to get data element for.
Return Value
 Id of MassSurfaceData or MassLevelData element.
Remarks
 This element will contain the properties associated with the MassEnergyAnalyticalModel face or MassLevelData that the MassZone Face is derived from.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The input Reference is not a face Reference of this MassZone.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MassZone Class
Autodesk.Revit.DB.Analysis Namespace